import googlemaps
from pymongo import MongoClient
import os
from dotenv import load_dotenv

load_dotenv()

TG_TOKEN_ADMIN = str(os.getenv('TG_TOKEN_ADMIN'))
API_KEY = str(os.getenv('GOOGLE_MAPS_TOKEN'))
host = str(os.getenv('SQL_HOST'))
user = str(os.getenv('SQL_USER'))
password = str(os.getenv('SQL_PASSWORD'))
db_name = str(os.getenv('SQL_DB_NAME'))

rosreestr_key = str(os.getenv('ROSREESTR_KEY'))

FAST_API_KEY = str(os.getenv('FAST_API_KEY'))
FAST_API_KEY_NAME = 'X-API-Key'
JWT_TOKEN = "Bearer " + str(os.getenv('JWT_TOKEN'))
JWT_TOKEN_NAME = 'Authorization'


api_node_link = 'https://egrn-api-selenium.ru/main-api'
api_python_link = 'https://egrn-api-selenium.ru'
chromedriver_path = '/usr/bin/chromedriver'
save_files_path = rf'/home/surikov-server/egrn/uploads'
cookies = rf'/home/surikov-server/egrn/cookies'
chromedriver_timeout = 20
WINDOW_SIZE = "1920,1080"


map_client = googlemaps.Client(key=API_KEY)


client = MongoClient(port=27017)
db = client.get_database('egrn')


street_types = ['проспект', 'площадь', 'аллея', 'улица', 'шоссе',
                'дорога', 'бульвар', 'въезд', 'заезд',
                'километр', 'кольцо', 'линия', 'набережная', 'остров', "парк",
                "переулок", "переезд", "проезд", "проулок", "сад", "сквер", "тупик", "участок", "аул", "аал",
                "городок", "деревня", "спуск", "канал", "вал", "ферма", "мост", "ряды", "берег", "просек", "протока",
                "бугор"]


towns = ['санкт-петербург', 'москва']
regions = ['ленинградская область', 'московская область']


regions_for_cadastral = {1: "Республика Адыгея",
                         2: "Республика Башкортостан",
                         3: "Республика Бурятия",
                         4: "Республика Алтай",
                         5: "Республика Дагестан",
                         6: "Республика Ингушетия",
                         7: "Кабардино-Балкарская Республика",
                         8: "Республика Калмыкия",
                         9: "Карачаево-Черкесская Республика",
                         10: "Республика Карелия",
                         11: "Республика Коми",
                         12: "Республика Марий Эл",
                         13: "Республика Мордовия",
                         14: "Республика Саха (Якутия)",
                         15: "Республика Северная Осетия",
                         16: "Республика Татарстан",
                         17: "Республика Тыва",
                         18: "Удмуртская Республика",
                         19: "Республика Хакасия",
                         20: "Чеченская Республика",
                         21: "Чувашская Республика",
                         22: "Алтайский край",
                         23: "Краснодарский край",
                         24: "Красноярский край",
                         25: "Приморский край",
                         26: "Ставропольский край",
                         27: "Хабаровский край",
                         28: "Амурская область",
                         30: "Астраханская область",
                         31: "Белгородская область",
                         32: "Брянская область",
                         33: "Владимирская область",
                         34: "Волгоградская область",
                         35: "Вологодская область",
                         36: "Воронежская область",
                         37: "Ивановская область",
                         38: "Иркутская область",
                         39: "Калининградская область",
                         40: "Калужская область",
                         41: "Камчатский край",
                         42: "Кемеровская область",
                         43: "Кировская область",
                         44: "Костромская область",
                         45: "Курганская область",
                         46: "Курская область",
                         47: "Ленинградская область",
                         48: "Липецкая область",
                         49: "Магаданская область",
                         50: "Московская область",
                         51: "Мурманская область",
                         52: "Нижегородская область",
                         53: "Новгородская область",
                         54: "Новосибирская область",
                         55: "Омская область",
                         56: "Оренбургская область",
                         57: "Орловская область",
                         58: "Пензенская область",
                         59: "Пермский край",
                         60: "Псковская область",
                         61: "Ростовская область",
                         62: "Рязанская область",
                         63: "Самарская область",
                         64: "Саратовская область",
                         65: "Сахалинская область",
                         66: "Свердловская область",
                         67: "Смоленская область",
                         68: "Тамбовская область",
                         69: "Тверская область",
                         70: "Томская область",
                         71: "Тульская область",
                         72: "Тюменская область",
                         73: "Ульяновская область",
                         74: "Челябинская область",
                         75: "Забайкальский край",
                         76: "Ярославская область",
                         77: "Москва",
                         78: "Санкт-Петербург",
                         79: "Еврейская А.обл.",
                         80: "Забайкальский край",
                         81: "Пермский край",
                         82: "Камчатский край",
                         83: "Ненецкий АО",
                         84: "Красноярский край",
                         85: "Иркутская область",
                         86: "Ханты-Мансийский АО",
                         87: "Чукотский АО",
                         88: "Красноярский край",
                         89: "Ямало-Ненецкий АО",
                         90: "Республика Крым",
                         91: "Севастополь"
                         }
